# Program 5 - Pandas: Merge, Group and Aggregation

In [1]:
import pandas as pd
import numpy as np

## Merge questions (Q1-3)

#### Question 1

Use the `merge` or `join` function to merge two dataframe `staff_df` and `student_df`, figure out the argument options yourself so that the merged dataframe should look like the expected output.

In [2]:
staff_df = pd.DataFrame([{'Name': 'Tim', 'Role': 'Director of HR'},
                         {'Name': 'Sandy', 'Role': 'Secretary'},
                         {'Name': 'John', 'Role': 'System support'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name': 'John', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Medicine'},
                           {'Name': 'Sandy', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')

def question_one():
    
    return staff_df.join(student_df)
    
    
# do not change the code below  
question_one()

                 Role       School
Name
Tim    Director of HR          NaN
Sandy       Secretary  Engineering
John   System support     Business

# **Expected output**

|     <br><br> Name   |Role <br>	      |School <br>   |
|--------------------:|------------------:|-------------:|
|Tim	              |Director of HR     |NaN           |
|Sandy	              |Secretary	      |Engineering   |
|John	              |System support     |Business      |

#### Question 2

Use the `merge` or `join` function to merge two dataframe `staff_df` and `student_df`, figure out the argument options yourself so that the merged dataframe should look like the following:

|	Name|	Role	|School|
|-------|-----------|------|
|0	|Tim	|Director of HR	|NaN|
|1	|Sandy	|Secretary	|Engineering|
|2	|John	|System support	|Business|
|3	|Mike	|NaN	|Medicine|

In [3]:
staff_df = pd.DataFrame([{'Name': 'Tim', 'Role': 'Director of HR'},
                         {'Name': 'Sandy', 'Role': 'Secretary'},
                         {'Name': 'John', 'Role': 'System support'}])
student_df = pd.DataFrame([{'Name': 'John', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Medicine'},
                           {'Name': 'Sandy', 'School': 'Engineering'}])
def question_two():

    return pd.merge(staff_df, student_df, how='outer')
    
# do not change the code below  
question_two()

    Name            Role       School
0    Tim  Director of HR          NaN
1  Sandy       Secretary  Engineering
2   John  System support     Business
3   Mike             NaN     Medicine

**Expected output**

| |	Name|	Role	|School|
|-|-------|-----------|------|
|0	|Tim	|Director of HR	|NaN|
|1	|Sandy	|Secretary	|Engineering|
|2	|John	|System support	|Business|
|3	|Mike	|NaN	|Medicine|

#### Question 3

Use the `merge` or `join` function to merge two dataframe `staff_df3` and `student_df3`, figure out the argument options yourself so that the merged dataframe should look like the expected output.

Hint: use multiple key [`First Name`,`Last Name`]

In [4]:
staff_df3 = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader'}])
student_df3 = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering'}])

def question_three():

    return pd.merge(staff_df3, student_df3)
    
# do not change the code below  
question_three()

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

**Expected output**

| |First Name|Last Name|Role|School|
|-|----------|---------|----|------|
|0|Sally	|Brooks	|Course liasion|Engineering|

## Grouping & aggregation questions (Q4-10)


**Note**: These questions are based on dataset of `census.csv`, and `groupby('STNAME')`

In [5]:
df = pd.read_csv('census.csv')
df = df[df['SUMLEV']==50]       # exclude the rows with SUMLEV==40 so that all rows are city-based
#df.head(2)

#### Question 4:  Group iteration

Iterate over the groups based on `groupby('STNAME')`, print out [group name(i.e., state) + group shape (each group is a dataframe)] of the states whose group labels are 0, 10, 20, 30, 40, 50, assuming the first group Alabama is labeled as 0, the second group labeled as 1, etc.

Your output should look like the expected output.

In [6]:
def question_four():

    # i is used to label group (or state)
    i = 0
   
    
    for state, group in df.groupby('STNAME'):
        if i % 10 == 0:
            print("{0:30} {1}".format(state, group.shape))
        
        i+=1

    
    
# do not change the code below  
question_four()

Alabama                        (67, 100)
Georgia                        (159, 100)
Maryland                       (24, 100)
New Jersey                     (21, 100)
South Carolina                 (46, 100)
Wyoming                        (23, 100)

**Expected output**

                        Alabama              (67, 100)
                        Georgia              (159, 100)
                        Maryland             (24, 100)
                        New Jersey           (21, 100)
                        South Carolina       (46, 100)
                        Wyoming              (23, 100)

#### Question 5: Group apply/aggregation

Use groupby object's aggregate or apply function to generate a new dataframe named as `df_state_agg_pop`, which should contain the following columns: [`STNAME,	average_pop,	total_pop,	largest_city_pop,	smallest_city_pop,	counties`].

 |Column Name | Description|
 |:-----------|:-----------|
 |STNAME |State name|
 |average_pop|Average city popopulation for each state, based on the column CENSUS2010POP|
 |total_pop|Total popopulation for each state, based on the column CENSUS2010PO|
 |largest_city_pop|Largest city popopulation for each state, based on the column CENSUS2010POP|
 |smallest_city_pop|Smallest city popopulation for each state, based on the column CENSUS2010PO|
 |counties|Total number of cities for each state|

Additional resources: https://pbpython.com/groupby-agg.html

In [7]:
# named aggregation
df_state_agg_pop = None

def question_five():


    df_state_agg_pop = df.groupby('STNAME')['CENSUS2010POP'].aggregate(average_pop='mean', total_pop='sum', 
                                                                       largest_city_pop='max', smallest_city_pop='min',
                                                                       counties='count')
    df_state_agg_pop = df_state_agg_pop.reset_index()
    
    
    return df_state_agg_pop

# do not change the code below  
df_state_agg_pop = question_five()
df_state_agg_pop.head()

,STNAME,average_pop,total_pop,largest_city_pop,smallest_city_pop,counties
0,Alabama,71339.343284,4779736,658466,9045,67
1,Alaska,24490.724138,710231,291826,662,29
2,Arizona,426134.466667,6392017,3817117,8437,15
3,Arkansas,38878.906667,2915918,382748,5368,75
4,California,642309.586207,37253956,9818605,1175,58

**Expected output**

<img src="images/p5_output5.png" style="width: 500px;">

#### Question 6: DataFrame selection and filter

Create a new dataframe `df_state_city`, based on the original dataframe df. The new dataframe contains the following columns: [STNAME,	CTYNAME,	CENSUS2010POP]

In [9]:
df_state_city=None

def question_six():

    df_state_city = df.filter(['STNAME', 'CTYNAME', 'CENSUS2010POP'])

    
    return df_state_city

# do not change the code below  
df_state_city = question_six()
df_state_city.head()

    STNAME         CTYNAME  CENSUS2010POP
1  Alabama  Autauga County          54571
2  Alabama  Baldwin County         182265
3  Alabama  Barbour County          27457
4  Alabama     Bibb County          22915
5  Alabama   Blount County          57322

**Expected output**

<img src="images/p5_output6.png" style="width: 300px;">

#### Question 7: Pandas merge

Create a new dataframe `df_state_city_agg_pop`, by merging two dataframes `df_state_city` and `df_state_pop`. 

**Note**: The two frames share the common column `STNAME`

In [10]:
# pd merge
df_state_city_agg_pop=None

def question_seven():

    df_state_city_agg_pop = pd.merge(df_state_city, df_state_agg_pop, on='STNAME')
    
    return df_state_city_agg_pop

# do not change the code below  
df_state_city_agg_pop=question_seven()
df_state_city_agg_pop.head()

,STNAME,CTYNAME,CENSUS2010POP,average_pop,total_pop,largest_city_pop,smallest_city_pop,counties
0,Alabama,Autauga County,54571,71339.343284,4779736,658466,9045,67
1,Alabama,Baldwin County,182265,71339.343284,4779736,658466,9045,67
2,Alabama,Barbour County,27457,71339.343284,4779736,658466,9045,67
3,Alabama,Bibb County,22915,71339.343284,4779736,658466,9045,67
4,Alabama,Blount County,57322,71339.343284,4779736,658466,9045,67

**Expected output**

<img src="images/p5_output7.png" style="width: 700px;">

#### Question 8: Filter

Filter the dataframe `df_state_city_agg_pop` so that :
 - Only the row of the largest population city for each state will be retained. 
 - Only the columns [`'STNAME','CTYNAME','CENSUS2010POP','largest_city_pop'`] will be retained. 

Save this result in a new frame as `df_state_largest_city_pop`

In [11]:
# find the largest population city for each state
df_state_largest_city_pop = None

def question_eight():

    df_state_largest_city_pop = pd.merge(df_state_city_agg_pop.groupby('STNAME')['CENSUS2010POP'].max(), df_state_city_agg_pop) 
    df_state_largest_city_pop = df_state_largest_city_pop.filter(['STNAME','CTYNAME','CENSUS2010POP','largest_city_pop'])
    
    return df_state_largest_city_pop

# do not change the code below  
df_state_largest_city_pop=question_eight()
df_state_largest_city_pop.head()

       STNAME                 CTYNAME  CENSUS2010POP  largest_city_pop
0     Alabama        Jefferson County         658466            658466
1      Alaska  Anchorage Municipality         291826            291826
2     Arizona         Maricopa County        3817117           3817117
3    Arkansas          Pulaski County         382748            382748
4  California      Los Angeles County        9818605           9818605

**Expected output**

<img src="images/p5_output8.png" style="width: 500px;">

#### Question 9: Pandas string

From the dataframe `df_state_largest_city_pop`, find the largest population city for states whose state names start with 'N'.

**Hint**: Should return 8 records.

In [12]:
# find the largest population city for states whose state names start with 'N'
def question_nine():

    return df_state_largest_city_pop[df_state_largest_city_pop['STNAME'].str.startswith('N')]
    
# do not change the code below  
question_nine()

            STNAME              CTYNAME  CENSUS2010POP  largest_city_pop
27        Nebraska       Douglas County         517110            517110
28          Nevada         Clark County        1951269           1951269
29   New Hampshire  Hillsborough County         400721            400721
30      New Jersey        Bergen County         905116            905116
31      New Mexico    Bernalillo County         662564            662564
32        New York         Kings County        2504700           2504700
33  North Carolina   Mecklenburg County         919628            919628
34    North Dakota          Cass County         149778            149778

**Expected output**

<img src="images/p5_output9.png" style="width: 500px;">

#### Question 10:  Groupby transform

Use groupby object's `transform` function to transform the original dataframe `df`'s column `CENSUS2010POP` into z-score normalized values (formated as 2 decimal points).Rename the the column `CENSUS2010POP` into `norm_pop_on_state`.

$$
z=\frac{x-\mu}{\sigma}
$$

Read more on z-normalization: https://www.statology.org/z-score-normalization/

In [13]:
def question_ten():

    df_transform = df.groupby('STNAME')['CENSUS2010POP'].transform(
        lambda x: ((x - x.mean()) / x.std()).round(2)).to_frame().rename(columns={'CENSUS2010POP':'norm_pop_on_state'})
       
    return (df_transform.head())
    
# do not change the code below  
question_ten()

   norm_pop_on_state
1              -0.16
2               1.07
3              -0.42
4              -0.47
5              -0.14

**Expected output**

||	norm_pop_on_state|
|--|-----------------|
|1|	-0.16|
|2|	 1.07|
|3|	-0.42|
|4|	-0.47|
|5|	-0.14|